pchwalek/STM32_MAX86150/max86150.h
/***************************************************
 Arduino library written for the Maxim MAX86150 ECG and PPG integrated sensor

 Written by Ashwin Whitchurch, ProtoCentral Electronics (www.protocentral.com)

 https://github.com/protocentral/protocentral_max86150

 Based on code written by Peter Jansen and Nathan Seidle (SparkFun) for the MAX30105 sensor
 BSD license, all text above must be included in any redistribution.
 *****************************************************/

#ifndef __MAX86150_H__
#define __MAX86150_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32wbxx_hal.h"


#define MAX86150_ADDRESS          0x5E //7-bit I2C Address
//Note that MAX30102 has the same I2C address and Part ID

#define I2C_SPEED_STANDARD        100000
#define I2C_SPEED_FAST            400000
#define byte											uint8_t
//#define USING_ECG									1

//Define the size of the I2C buffer based on the platform the user has
#if defined(__AVR_ATmega328P__) || defined(__AVR_ATmega168__)

  //I2C_BUFFER_LENGTH is defined in Wire.H
  #define I2C_BUFFER_LENGTH BUFFER_LENGTH

#elif defined(__SAMD21G18A__)

  //SAMD21 uses RingBuffer.h
  #define I2C_BUFFER_LENGTH SERIAL_BUFFER_SIZE

#else

//The catch-all default is 64
#define I2C_BUFFER_LENGTH 64

#endif

class MAX86150 {
public:
	MAX86150(void);

	bool begin(uint8_t i2c_address = MAX86150_ADDRESS, I2C_HandleTypeDef *i2c_handle = 0);

	uint32_t getRed(void); //Returns immediate red value
	uint32_t getIR(void); //Returns immediate IR value
	int32_t getECG(void); //Returns immediate ECG value
	bool safeCheck(uint8_t maxTimeToCheck); //Given a max amount of time, check for new data

	// Configuration
	void softReset();
	void shutDown();
	void wakeUp();

	void setLEDMode(uint8_t mode);

	void setADCRange(uint8_t adcRange);
	void setSampleRate(uint8_t sampleRate);
	void setPulseWidth(uint8_t pulseWidth);

	void setPulseAmplitudeRed(uint8_t value);
	void setPulseAmplitudeIR(uint8_t value);
	void setPulseAmplitudeProximity(uint8_t value);

	void setProximityThreshold(uint8_t threshMSB);

	//Multi-led configuration mode (page 22)
	void enableSlot(uint8_t slotNumber, uint8_t device); //Given slot number, assign a device to slot
	void disableSlots(void);

	// Data Collection

	//Interrupts (page 13, 14)
	uint8_t getINT1(void); //Returns the main interrupt group
	uint8_t getINT2(void); //Returns the temp ready interrupt
	void enableAFULL(void); //Enable/disable individual interrupts
	void disableAFULL(void);
	void enableDATARDY(void);
	void disableDATARDY(void);
	void enableALCOVF(void);
	void disableALCOVF(void);
	void enablePROXINT(void);
	void disablePROXINT(void);
	void enableDIETEMPRDY(void);
	void disableDIETEMPRDY(void);

	//FIFO Configuration (page 18)
	void setFIFOAverage(uint8_t samples);
	void enableFIFORollover();
	void disableFIFORollover();
	void setFIFOAlmostFull(uint8_t samples);

	//FIFO Reading
	uint16_t check(void); //Checks for new data and fills FIFO
	uint8_t available(void); //Tells caller how many new samples are available (head - tail)
	uint16_t nextSample(void); //Advances the tail of the sense array
	uint32_t getFIFORed(void); //Returns the FIFO sample pointed to by tail
	uint32_t getFIFOIR(void); //Returns the FIFO sample pointed to by tail
	int32_t getFIFOECG(void); //Returns the FIFO sample pointed to by tail

	uint8_t getWritePointer(void);
	uint8_t getReadPointer(void);
	void clearFIFO(void); //Sets the read/write pointers to zero

	//Proximity Mode Interrupt Threshold
	void setPROXINTTHRESH(uint8_t val);

	// Die Temperature
	float readTemperature();
	float readTemperatureF();

	// Detecting ID/Revision
	uint8_t getRevisionID();
	uint8_t readPartID();
	uint8_t readRegLED();

	// Setup the IC with user selectable settings
	void setup(byte powerLevel = 0x1F, byte sampleAverage = 4, byte ledMode = 3,
			int sampleRate = 400, int pulseWidth = 411, int adcRange = 4096);

	// Low-level I2C communication
	uint8_t readRegister8(uint8_t address, uint8_t reg);
	bool writeRegister8(uint8_t address, uint8_t reg, uint8_t value);
	bool write(uint8_t *data, uint8_t size);
	bool read(uint8_t *data, uint8_t size);

private:
	I2C_HandleTypeDef *i2c_han = NULL;///< Pointer to I2C bus interface
	uint8_t i2c_addr = 0;

	//activeLEDs is the number of channels turned on, and can be 1 to 3. 2 is common for Red+IR.
	byte activeDevices; //Gets set during setup. Allows check() to calculate how many bytes to read from FIFO

	uint8_t revisionID;


	void readRevisionID();

	void bitMask(uint8_t reg, uint8_t mask, uint8_t thing);

#define STORAGE_SIZE 40 //Each long is 4 bytes so limit this to fit on your micro
	typedef struct Record {
		uint32_t red[STORAGE_SIZE];
		uint32_t IR[STORAGE_SIZE];
#if USING_ECG
		int32_t ecg[STORAGE_SIZE];
#endif
		byte head;
		byte tail;
	} sense_struct; //This is our circular buffer of readings from the sensor

	sense_struct sense;

};

#ifdef __cplusplus
}
#endif

#endif
